Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: On the right hand side of the object browser window, all objects contained by the EDS file are shown.
it_it: Sul lato destro della finestra dell'object browser vengono visualizzati tutti gli oggetti contenuti nel file EDS.

source: On the right side of the dialog, all assigned modules are shown.
it_it: Sul lato destro della finestra di dialogo vengono visualizzati tutti i moduli assegnati.

source: Onboard 4.3inch LCD display, 800×480 resolution, 65K color
it_it: Display LCD integrato da 4,3 pollici, risoluzione 800x480, 65.000 colori

source: Onboard CAN, RS485, I2C interface and TF card slot, integrates full-speed USB
it_it: Interfaccia CAN, RS485, I2C e slot per schede TF integrati, integra USB full-speed

source: Onboard Resources
it_it: Risorse Integrate

source: Once that is done, the I parameter is increased until the actual flux is as close to the desired flux as possible.
it_it: Una volta fatto ciò, il parametro I viene aumentato fino a quando il flusso effettivo non si avvicina il più possibile al flusso desiderato.

source: One Sync: Sends just one SYNC command on the CAN bus.
it_it: One Sync: Invia un solo comando SYNC sul bus CAN.

source: Only if for example a newer firmware version for a specific module is provided by Trinamic it might be necessary to integrate the newer EDS file into the TMCL-IDE.
it_it: Solo se, ad esempio, Trinamic fornisce una versione firmware più recente per un modulo specifico, potrebbe essere necessario integrare il file EDS più recente in TMCL-IDE.

source: Only interfaces contained in this (steadily growing) list of CAN interfaces are supported by the TMCL-IDE.
it_it: Solo le interfacce contenute in questo elenco (in costante crescita) di interfacce CAN sono supportate da TMCL-IDE.

source: Only objects where the Refuse Read on Scan flag is set in the EDS file will not be saved.
it_it: Solo gli oggetti in cui è impostato il flag Refuse Read on Scan nel file EDS non verranno salvati.

source: Only prints "IDLE loop" and waits for 1 second without any other substantial action.
it_it: Stampa solo "IDLE loop" e attende 1 secondo senza altre azioni sostanziali.

source: Only the lower 11 bits are shown and can be set here.
it_it: Vengono visualizzati solo gli 11 bit inferiori e possono essere impostati qui.

source: Open Arduino, then open the board manager, you can see that esp32-arduino has been installed
it_it: Aprire Arduino, poi aprire il "board manager": si può vedere che esp32-arduino è stato installato

source: Open In the Software
it_it: Aprire il Software

source: Open Python IDLE, click "File -> Open..." at the top.
it_it: Aprire Python IDLE, cliccare su "File -> Open..." in alto,

source: Open VScode software and select the folder to open the demo
it_it: Aprire il software VScode e selezionare la cartella in cui aprire la demo

source: Open from Outside the Software
it_it: Aprire dall'Esterno del Software

source: Open the Serial Monitor window, and the demo will print "Hello World!" every 2 seconds, and the operation is as follows:
it_it: Aprire la finestra Serial Monitor e la demo stamperà "Hello World!" ogni 2 secondi; il funzionamento è il seguente:

source: Open the Device Configuration tool and enter all necessary file information and device commissioning information.
it_it: Aprire il tool Device Configuration e inserire tutte le informazioni necessarie sul file e sulla messa in servizio del dispositivo.

source: Open the directory that contains the TMCL-IDE.
it_it: Aprire la directory che contiene TMCL-IDE.

source: Open the download page of VScode official website, choose the corresponding system and system bit to download
it_it: Aprire la pagina di download del sito web ufficiale di VScode, scegliere il sistema e il bit di sistema corrispondenti da scaricare

source: Open the serial port debugging assistant to send a message to the ESP32-S3-Touch-LCD-4.3 device, and the device will return the received message to the serial port debugging assistant
it_it: Aprire l'assistente di debug della porta seriale per inviare un messaggio al dispositivo ESP32-S3-Touch-LCD-4.3, che restituirà il messaggio ricevuto all'assistente per il debug della porta seriale

source: Open: loads a TMCL file into a new editor tab.
it_it: Open: carica un file TMCL in una nuova scheda dell'editor.

source: Operating Current
it_it: Corrente

source: Operating System
it_it: Sistema Operativo

source: Operating Temperature
it_it: Temperatura di Funzionamento

source: Operating Voltage
it_it: Tensione

source: Operating temperature
it_it: Temperatura di esercizio

source: Operator
it_it: Operatore

source: Operators in Constant Expressions
it_it: Operatori nelle Espressioni Costanti

source: Optionally the alias name of the module can also be supplied as a third parameter (in brackets).
it_it: Facoltativamente, è possibile fornire anche il nome alias del modulo come terzo parametro (tra parentesi).

source: Options
it_it: Opzioni

source: Options: Properties of tool windows moving or behavior.
it_it: Options: Proprietà dello spostamento o del comportamento delle finestre degli strumenti.

source: Options: The Options entry provides the following functions:
it_it: Options: La voce Options fornisce le seguenti funzioni:

source: Or copy to SPI example:
it_it: Oppure copiare nell'esempio SPI:

source: Or if the module is set to a different ID, set both values to that ID.
it_it: Oppure, se il modulo è impostato su un ID diverso, impostare entrambi i valori su quell'ID.

source: Or you can modify the file path in the demo as the DLL file storage path.
it_it: Oppure è possibile modificare il path del file nella demo come path di archiviazione del file DLL.

source: Or you can modify the file path of the demo as a DLL file storage path.
it_it: Oppure è possibile modificare il path del file demo come quello di archiviazione dei file DLL.

source: Other
it_it: Altro

source: Other Components
it_it: Altri Componenti

source: Other EDS files (that can either be newer EDS files from Trinamic or EDS files from other manufacturers) can be integrated into the TMCL-IDE as follows:
it_it: Altri file EDS (che possono essere file EDS più recenti di Trinamic o file EDS di altri produttori) possono essere integrati in TMCL-IDE come segue:

source: Other Options
it_it: Altre Opzioni

source: Other Resource Links
it_it: Link ad Altre Risorse

source: Other Status Bar Functions
it_it: Altre Funzioni della Barra di Stato

source: Other instructions
it_it: Altre istruzioni

source: Other options: Here the register contents can be save to a C/C++ file with different options.
it_it: Other options: Qui il contenuto del registro può essere salvato in un file C/C++ con diverse opzioni.

source: Other tools of the TMCL-IDE can still be used with care.
it_it: Gli altri strumenti di TMCL-IDE possono comunque essere utilizzati con cautela.

source: Otherwise an error message will be shown.
it_it: In caso contrario, verrà visualizzato un messaggio di errore.

source: Otherwise it will be loaded from file, using the include file path that can be set in the Options dialogue of the TMCL Creator.
it_it: In caso contrario, verrà caricato dal file, utilizzando il path del file "include" impostabile nella finestra di dialogo Options di TMCL Creator.

source: Overview
it_it: Panoramica

source: P parameter will start to increase until the actual motor velocity reaches 80% of the target velocity.
it_it: Il parametro P inizierà ad aumentare fino a quando la velocità effettiva del motore non raggiunge l'80% della velocità target.

source: PCAN-USB (IPEH-002021 or IPEF-002022) PCAN-USB Pro
it_it: PCAN-USB (IPEH-002021 o IPEF-002022) PCAN-USB Pro

source: PDO mappable: Shows if the object can be mapped to PDOs.
it_it: PDO mappable: Indica se l'oggetto può essere mappato sui PDO.

source: PH1.25 lithium battery holder only supports a single 3.7V lithium battery, do not use multiple sets of battery packs to connect to charge and discharge at the same time, and it is recommended that the capacity of a single battery is less than 2000mAH
it_it: Il supporto per batterie al litio PH1.25 supporta solo una singola batteria al litio da 3,7 V; non utilizzare più set di batterie da collegare per caricare e scaricare contemporaneamente; si consiglia che la capacità di una singola batteria sia inferiore a 2000 mAH.

source: PH2.0 battery interface: The development board uses a high-efficiency charge/discharge management chip CS8501, which can boost a single lithium battery to 5V, the current charging current is 580mA, and the user can change the charging current by replacing the R45 resistor, please refer to ESP32-S3-Touch-LCD-4.3 Schematic for details.
it_it: PH2.0 battery interface: La scheda di sviluppo utilizza un chip di gestione carica/scarica ad alta efficienza CS8501, in grado di caricare una singola batteria al litio fino a 5 V. La corrente di carica attuale è di 580 mA e l'utente può modificare la corrente di carica sostituendo la resistenza R45. Per i dettagli, fare riferimento allo schema ESP32-S3-Touch-LCD-4.3.

source: PI tuning tool
it_it: Tool di tuning PI

source: PID: These are the parameters of the PID regulators.
it_it: PID: Questi sono i parametri dei regolatori PID.

source: PWM amplitude: Maximum PWM amplitude when switching to StealthChop mode.
it_it: PWM amplitude: Ampiezza PWM massima quando si passa alla modalità StealthChop.

source: PWM autoscale: enable or disable automatic PWM scaling.
it_it: PWM autoscale: abilita o disabilita la scalatura automatica del PWM.

source: PWM frequency: the frequency of the chopper PWM.
it_it: PWM frequency: la frequenza del PWM del chopper.

source: PWM gradient: Velocity dependent gradient for the PWM amplitude.
it_it: PWM gradient: Gradiente dipendente dalla velocità per l'ampiezza PWM.

source: PWM threshold speed: if the speed drops below this speed the StealthChop scheme can be activated to make the motor run quietly.
it_it: PWM threshold speed: se la velocità scende al di sotto di questo valore, è possibile attivare lo schema StealthChop per far funzionare il motore in modo silenzioso.

source: PWR: Power indicator
it_it: PWR: Indicatore di alimentazione

source: Package 8MB PSRAM and 16MB Flash
it_it: Package 8MB PSRAM e 16MB Flash

source: Parameter Name
it_it: Nome Parametro

source: Parameter list: Pick parameters that are to be displayed from this list or deselect parameters that are no longer to be displayed here.
it_it: Parameter list: Selezionare i parametri da visualizzare da questo elenco o deselezionare i parametri che non si desidera più visualizzare.

source: Parameters
it_it: Parametri

source: Parenthesis
it_it: Parentesi

source: Pause between TMCL commands: in some rare cases it seems to be necessary to insert pauses between commands as otherwise errors might occur.
it_it: Pausa tra i comandi TMCL: in alcuni rari casi sembra necessario inserire delle pause tra i comandi, altrimenti potrebbero verificarsi errori.

source: Pause: The Pause function stops the execution of a running program, but the execution of the program can be continued by the Run/Continue function, the Single Step function or the Animate function.
it_it: Pause: La funzione Pause interrompe l'esecuzione di un programma in esecuzione, ma l'esecuzione del programma può proseguire tramite la funzione Run/Continue, la funzione Single Step o la funzione Animate.

source: Peripheral
it_it: Periferica

source: Peripheral interface
it_it: Interfaccia periferica

source: Peripheral（TF-Luna）
it_it: Periferica（TF-Luna）

source: Pick the desired commutation mode from the list.
it_it: Selezionare la modalità di commutazione desiderata dall'elenco.

source: Pinouts
it_it: Pinout

source: Place the extraction file in the Arduino package directory of the corresponding user
it_it: Posizionare il file di estrazione nella directory del pacchetto Arduino dell'utente corrispondente

source: Please adjust it according to your system.
it_it: Adattarlo al proprio sistema.

source: Please adjust the mode before powering on it.
it_it: Regolare la modalità prima di accenderlo.

source: Please be patient as we make every effort to help you to resolve the issue.
it_it: Preghiamo di avere pazienza: faremo tutto il possibile per aiutare a risolvere il problema.

source: Please be sure that no other program is accessing the module via the USB interface before reconnecting.
it_it: Assicurarsi che nessun altro programma stia accedendo al modulo tramite l'interfaccia USB prima di riconnettersi.

source: Please bear in mind that the transmission type must be set to 254 or to 255 in order to be able to use an event timer value greater than zero.
it_it: Si tenga presente che il tipo di trasmissione deve essere impostato su 254 o 255 per poter utilizzare un valore del timer evento maggiore di zero.

source: Please check whether the allowable level of the equipment communicating with this product is 3.3V or 5V.
it_it: Verificare se il livello consentito dell'apparecchiatura che comunica con questo prodotto è 3,3 V o 5 V.

source: Please check whether the communication device supports 5V.
it_it: Verificare che il dispositivo di comunicazione supporti 5 V.

source: Please enter the device address + register address in the I2C output box as follows:
it_it: Inserire l'indirizzo del dispositivo + l'indirizzo del registro nella casella di output I2C come segue:

source: Please install Arduino esp32 version ≥v3.0.2, this can solve the issue
it_it: Installare Arduino esp32 versione ≥v3.0.2, questo potrebbe risolvere il problema.

source: Please note that if the slave device has other corresponding operations for data acquisition, please make adjustments according to the specific operations of the slave device.
it_it: Si noti che se il dispositivo slave ha altre operazioni corrispondenti per l'acquisizione dati, apportare modifiche in base alle operazioni specifiche del dispositivo slave.

source: Please note that only those parameters that have been changed will be sent to the device.
it_it: Si noti che solo i parametri modificati verranno inviati al dispositivo.

source: Please note that setting the wrong boards may lead to unexpected behavior.
it_it: Notare che l'impostazione di board errate può causare comportamenti imprevisti.

source: Please note that the GND of each device needs to be connected together.
it_it: Si prega di notare che i GND di ciascun dispositivo devono essere collegati tra loro.

source: Please note that the commands AAP and AGP are special cases: they are executed locally, but change a value in on module with the given module index.
it_it: Si noti che i comandi AAP e AGP sono casi speciali: vengono eseguiti localmente, ma modificano un valore in un modulo con l'indice del modulo specificato.

source: Please note that the object will not be removed from the list of mappable objects, as each object can also be mapped more than once.
it_it: Si noti che l'oggetto non verrà rimosso dall'elenco degli oggetti mappabili, poiché ogni oggetto può essere mappato più di una volta.

source: Please note that the time stamp shown here may differ from the time stamp shown in the main log window by a few milliseconds.
it_it: Si noti che il timestamp visualizzato qui potrebbe differire di alcuni millisecondi da quello visualizzato nella finestra principale del log.

source: Please note that this function only stops the execution of the program.
it_it: Si noti che questa funzione arresta solo l'esecuzione del programma.

source: Please note that this will also reset all settings for the graphical view.
it_it: Si noti che questa operazione reimposterà anche tutti i settaggi per la visualizzazione grafica.

source: Please note: Do not name files with spaces!
it_it: Nota: Non inserire spazi nei nomi!

source: Please note: Make sure the device is at 3V3 and not 5V (keep the same potential as the device to be flashed).
it_it: Nota: Il dispositivo deve stare a 3V3 e non a 5V (mantenere lo stesso potenziale del dispositivo da flashare).

source: Please pay attention to the PCB antenna area when using, and avoid attaching other metals or plastic parts to the PCB antenna
it_it: Prestare attenzione all'area dell'antenna sul PCB durante l'utilizzo ed evitare di fissarvi altri componenti metallici o in plastica.

source: Please refer to SquareLine Studio tutorial
it_it: Consultare il tutorial di SquareLine Studio

source: Please see also chapter 8 for details.
it_it: Consultare anche il capitolo 8 per i dettagli.

source: Please see also the TMCL Firmware Manual of your module to learn more about the relations between the different physical units.
it_it: Consultare anche il manuale del firmware TMCL del modulo per saperne di più sulle relazioni tra le diverse unità fisiche.

source: Please see also the TMCL Firmware Manual of your module to learn more about using TMCL as a programming language.
it_it: Consultare anche il Manuale del Firmware TMCL del modulo per saperne di più sull'utilizzo di TMCL come linguaggio di programmazione.

source: Please see also the chapter about the syntax of TMCL/PC.
it_it: Si veda anche il capitolo sulla sintassi di TMCL/PC.

source: Please see also the hardware manual of your module on how to properly connect the module to the serial port.
it_it: Consultare anche il manuale hardware del modulo per informazioni su come collegare correttamente il modulo alla porta seriale.

source: Please see also the sample program files that are available on the TRINAMIC website.
it_it: Consultare anche i file di programma di esempio disponibili sul sito web di TRINAMIC.

source: Please see also the sections about combining direct mode and standalone mode in the TMCL Firmware Manual of your module for more about this.
it_it: Per ulteriori informazioni, consultare anche le sezioni sulla combinazione di modalità diretta e modalità standalone nel Manuale del firmware TMCL del modulo.

source: Please see the TMCL Firmware Manual of your module for detailed explanations of all commands sup-ported by the specific module.
it_it: Consultare il "TMCL Firmware Manual" del modulo per spiegazioni dettagliate su tutti i comandi supportati dal modulo specifico.

source: Please see the TMCL Firmware Manual of your module for further details about these parameters.
it_it: Per ulteriori dettagli su questi parametri, consultare il manuale del firmware TMCL del modulo.

source: Please see the TMCL Firmware Manual of your module for more about this.
it_it: Per ulteriori informazioni, consultare il Manuale del firmware TMCL del modulo.

source: Please see the TMCL Firmware Manual of your module for more information about these settings.
it_it: Consultare il manuale del firmware TMCL del modulo per ulteriori informazioni su queste impostazioni.

source: Please see the TMCL Firmware Manual of your module to learn more about each parameter.
it_it: Consultare il Manuale del firmware TMCL del modulo per ulteriori informazioni su ciascun parametro.

source: Please see the TMCL Firmware Manual of your module to learn more about the relations between the internal units of the module and the physical units for velocity and acceleration.
it_it: Consultare il Manuale del Firmware TMCL del modulo per ulteriori informazioni sulle relazioni tra le unità interne del modulo e le unità fisiche di velocità e accelerazione.

source: Please see the TMCL Firmware Manual of your module to learn more about the status flags and the error flags provided by your module.
it_it: Consultare il Manuale del firmware TMCL del modulo per ulteriori informazioni sui flag di stato e sui flag di errore forniti dal modulo.

source: Please see the TMCL Firmware Manual to learn more about the close loop parameters.
it_it: Consultare il Manuale del Firmware TMCL per ulteriori informazioni sui parametri a ciclo chiuso.

source: Please see the datasheet of the chip for details on SPI datagrams.
it_it: Consultare il datasheet del chip per i dettagli sui datagrammi SPI.

source: Please see the hardware manual of your module and also the manual of your CAN interface on how to properly connect the module to the CAN interface.
it_it: Consultare il manuale hardware del modulo e il manuale dell'interfaccia CAN per informazioni su come collegare correttamente il modulo all'interfaccia CAN.

source: Please select the COM ports according to your device (You can view it from the device manager)
it_it: Selezionare le porte COM in base al dispositivo (si può visualizzarle da "device manager")

source: Please set the mode switch to mode 1 or mode 2 and connect the computer after connecting the cable.
it_it: Impostare lo switch sulla Modalità 1 o Modalità 2 e collegare il computer dopo aver connesso il cavo.

source: Please set the mode switch to mode 1 or mode 2 and connect the computer after connecting the cable..
it_it: Impostare lo switch sulla modalità 1 o modalità 2 e collegare il computer dopo aver connesso il cavo.

source: Please switch the mode to mode 1 or mode 2 and connect the computer after connecting the cable.
it_it: Impostare la modalità su 1 o 2 e collegare il computer dopo aver connesso il cavo.

source: Please switch to Mode 1 or Mode 2, and connect to the computer by connecting the cables.
it_it: Passare alla Modalità 1 o alla Modalità 2 e collegarsi al computer connettendo i cavi.

source: Please try to press the fullclean button in the status bar and recompile the flashing, this function is to clean up all the compiled content by clicking when the project compilation error or other operations pollute the compiled content
it_it: Provare a premere il pulsante fullclean nella barra di stato e ricompilare il flashing. Questa funzione serve a pulire tutto il contenuto compilato, cliccando quando si verifica un errore di compilazione del progetto o altre operazioni che inquinano il contenuto compilato.

source: Please use an external power supply for the device connected to the product and connect the GND of the power supply device to the GND of the product.
it_it: Utilizzare un alimentatore esterno per il dispositivo collegato al prodotto e collegare il GND del dispositivo di alimentazione al GND del prodotto.

source: Points only: Selects if the data points are to be linked by lines or just the data points are to be shown, not linked by lines.
it_it: Points only: Seleziona se i punti dati devono essere collegati da linee o se devono essere visualizzati solo i punti dati, non collegati da linee.

source: Porting Description
it_it: Descrizione del Porting

source: Porting Reference
it_it: Riferimento al Porting

source: Position tuning
it_it: Regolazione della posizione

source: Position tuning can also be done both in auto and manual modes as described below.
it_it: La regolazione della posizione può essere eseguita sia in modalità automatica che manuale, come descritto di seguito.

source: Power
it_it: Elevamento a potenza

source: Power Supply
it_it: Alimentazione

source: Power consumption
it_it: Consumo energetico

source: Power cycle the module (when using USB, also disconnect and then re-connect the USB cable) and also re-start the TMCL-IDE.
it_it: Spegnere e riaccendere il modulo (se si utilizza USB, scollegare e ricollegare anche il cavo USB) e riavviare TMCL-IDE.

source: Power off completely, press and hold the Boot button and power it on again, then release it, enter the download mode, re-flash the program, reset and run.
it_it: Spegnere completamente la scheda, tenere premuto il pulsante di Boot e riaccenderla, quindi rilasciarlo, entrare in modalità download, rieseguire il flashing del programma, resettare ed eseguire.

source: Power to Base e
it_it: Potenza in Base e

source: Pre-Op: Issues an NMT Pre-Op command for all modules connected to the bus.
it_it: Pre-Op: Invia un comando NMT Pre-Op per tutti i moduli connessi al bus.
